# settings.py
import pygame

# Размеры окна
WIDTH = 480
HEIGHT = 800
FPS = 60

# Настройки сетки
GRID_SIZE = 8
CELL_SIZE = 50
GRID_OFFSET_X = (WIDTH - (GRID_SIZE * CELL_SIZE)) // 2
GRID_OFFSET_Y = 200

# Цвета (заглушки для твоих будущих текстур)
BG_COLOR = (70, 110, 120)       # Фон как на скринах
GRID_COLOR = (40, 60, 70)       # Цвет пустых ячеек сетки
LINE_COLOR = (30, 50, 60)       # Цвет линий сетки
TEXT_COLOR = (255, 255, 255)

# Формы фигур (1 - есть блок, 0 - пусто)
SHAPES_DATA = [
    [[1, 1, 1, 1]],             # Линия 4x1
    [[1], [1], [1], [1]],       # Линия 1x4
    [[1, 1], [1, 1]],           # Квадрат 2x2
    [[1, 0], [1, 0], [1, 1]],   # L-форма
    [[0, 0], [1, 0], [1, 1]],   # sh-L форма
  # [[1, 0], [1, 0], [1, 1]],   # L-форма2
    [[1, 1, 1], [0, 1, 0]],     # T-форма
    [[1, 1, 1]],                # Линия 3x1

]